#ifndef LILKA_FMATH_H
#define LILKA_FMATH_H

namespace lilka {

/// Швидке обчислення синуса.
///
/// Ця функція працює значно швидше, ніж стандартна функція синуса, але лише для цілих значень кута.
/// @param deg Кут в градусах.
/// @return Значення синуса кута.
float fSin360(int deg);

/// Швидке обчислення косинуса.
///
/// Ця функція працює значно швидше, ніж стандартна функція косинуса, але лише для цілих значень кута.
/// @param deg Кут в градусах.
/// @return Значення косинуса кута.
float fCos360(int deg);

/// Швидке обчислення синуса для кутів, кратних 11.25 градусів (тобто для кола, поділеного на 32 сектори).
///
/// @param fract Кут в градусах, поділений на 32.
/// @return Значення синуса кута.
///
/// @code
/// float a = fSin32(1); // Те саме, що і ``sin(11.25°)``
/// float b = fSin32(8); // Те саме, що і ``sin(90°)``
/// float c = fSin32(16); // Те саме, що і ``sin(180°)``
/// @endcode
float fSin32(int fract);

/// Швидке обчислення косинуса для кутів, кратних 11.25 градусів (тобто для кола, поділеного на 32 сектори).
///
/// \param fract Кут в градусах, поділений на 32.
/// \return Значення косинуса кута.
float fCos32(int fract);

} // namespace lilka

#endif // LILKA_FMATH_H
